espressif/esp-idf/tools/test_apps/system/build_test/sdkconfig.ci.esp32s3_mspi_timing_assertion_disabled
# Any of a set of configurations that will trigger timing tuning

CONFIG_IDF_TARGET="esp32s3"
CONFIG_SPI_FLASH_HPM_ENA=y
CONFIG_ESPTOOLPY_FLASHFREQ_120M=y
CONFIG_BOOTLOADER_FLASH_DC_AWARE=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y
